# EaveCuts Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoofBase..::..EaveCuts Property
RoofBase Class See Also
---
Retrieve or set the EaveCutterType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public EaveCutterType EaveCuts { get; set; }
```

Visual Basic
---
```text
Public Property EaveCuts As EaveCutterType
	Get
	Set
```

Visual C++
---
```text
public:
property EaveCutterType EaveCuts {
	EaveCutterType get ();
	void set (EaveCutterType value);
}
```

# See Also
RoofBase Class
Autodesk.Revit.DB Namespace